<?php
/**
 * csv.php
 * Copyright (C) 2016 thegrumpydictator@gmail.com
 *
 * This software may be modified and distributed under the terms of the
 * Creative Commons Attribution-ShareAlike 4.0 International License.
 *
 * See the LICENSE file for details.
 */

declare(strict_types = 1);

return [

    'import_configure_title' => 'Налаштувати свій імпорт',
    'import_configure_intro' => 'Є кілька варіантів для вашого імпорту CSV. Будь ласка, вкажіть, якщо ваш CSV-файл містить заголовки на першій колонці, і що дата, Формат дати-філдс. Це може зажадати деяких експериментів. Роздільник полів зазвичай є ", " може бути ";". Уважно перевірте це.',
    'import_configure_form'  => 'Форма',
    'header_help'            => 'Встановіть цей прапорець, якщо перший рядок файлу CSV заголовки стовпців',
    'date_help'              => 'Формат дати і часу в файл CSV. Дотримуйтесь формату, як <a href="https://secure.php.net/manual/en/datetime.createfromformat.php#refsect1-datetime.createfromformat-parameters">this page</a> вказує. Значення за замовчуванням буде парсити дати, які виглядають так: :dateExample.',
    'delimiter_help'         => 'Вибрати роздільник полів, який використовується у вашому вхідному файлі. Якщо не впевнені, кома-це найбезпечніший варіант.',
    'import_account_help'    => 'Якщо CSV-файл не містить інформації про обліковий запис актив(и), використовуйте випадаючий список, щоб вибрати, на який рахунок проводки в CSV належать.',
    'upload_not_writeable'   => 'Сіре поле містить шлях до файлу. Він повинен бути доступний для запису. Будь ласка, переконайтеся, що це.',

    // roles
    'column_roles_title'     => 'Визначення ролей колонки',
    'column_roles_text'      => '<p>Firefly II не можуть вгадати, які дані в кожному стовпці міститься. Ви повинні розповісти Світлячок, які дані очікувати. Приклад даних може направляти вас у виборі правильного типу з випадаючого списку. Якщо стовпець не може бути підібраний до корисним типом даних, будь ласка, дайте мені знати <a href="https://github.com/JC5/firefly-iii/issues/new">by створення issue</a>.Значення </p><p>Some в CSV-файл, такі як імена облікових записів або категорій, може вже існувати в базі даних Світлячок Розділ III. Якщо ви виберіть "показувати ці значення" Світлячка не буде намагатися шукати відповідні значення сама по собі, але дозволяють зіставити значення в CSV зі значеннями в базі даних. Це дозволяє точно налаштувати імпорт.</p>',
    'column_roles_table'     => 'Таблиця',
    'column_name'            => 'Ім\'я стовпця',
    'column_example'         => 'Приклад стовпця даних',
    'column_role'            => 'Дані стовпця значення',
    'do_map_value'           => 'Зіставити ці значення',
    'column'                 => 'Колонки',
    'no_example_data'        => 'Без прикладу даних',
    'store_column_roles'     => 'Продовжити імпорт',
    'do_not_map'             => '(не мапі)',
    'map_title'              => 'Підключити імпорту даних в "Світлячок" III дані',
    'map_text'               => 'У таблицях нижче, зліва значення показує Вам інформацію в ваш завантажений файл у форматі CSV. Це ваше завдання на карті це значення, якщо це можливо, значення вже є в базі даних. Світлячок буде дотримуватися цього зіставлення. Якщо немає ніякого значення для зіставлення, або Ви не хочете зіставити певне значення, вибрати нічого.',

    'field_value'          => 'Поле значення',
    'field_mapped_to'      => 'Зіставлені',
    'store_column_mapping' => 'Зіставлення магазині',

    // map things.


    'column__ignore'                => '(ігнорувати Цей стовпець)',
    'column_account-iban'           => 'Рахунки активів (ЗКГНГ)',
    'column_account-id'             => 'Рахунок інвентарний номер (відповідні Світлячок)',
    'column_account-name'           => 'Рахунки активів (ім\'я)',
    'column_amount'                 => 'Сума',
    'column_amount-comma-separated' => 'Сума (кому як десятковий роздільник)',
    'column_bill-id'                => 'Білл ідентифікатор (відповідні Світлячок)',
    'column_bill-name'              => 'Ім\'я Білла',
    'column_budget-id'              => 'Бюджетні ідентифікатор (відповідність Світлячок)',
    'column_budget-name'            => 'Найменування бюджету',
    'column_category-id'            => 'ID категорії (відповідність Світлячок)',
    'column_category-name'          => 'Назва категорії',
    'column_currency-code'          => 'Код валюти (ISO 4217)',
    'column_currency-id'            => 'Ідентифікатор валюти (відповідність Світлячок)',
    'column_currency-name'          => 'Назву валюти (відповідність Світлячок)',
    'column_currency-symbol'        => 'Символ валюти (для Світляка)',
    'column_date-interest'          => 'Дата нарахування відсотків',
    'column_date-book'              => 'Дата проведення операції',
    'column_date-process'           => 'Дата обробки транзакції',
    'column_date-transaction'       => 'Дата',
    'column_description'            => 'Опис',
    'column_opposing-iban'          => 'Протилежні рахунку (iban)',
    'column_opposing-id'            => 'Протилежні ідентифікатор облікового запису (відповідні Світлячок)',
    'column_external-id'            => 'Зовнішній ідентифікатор',
    'column_opposing-name'          => 'Протилежні рахунку (ім\'я)',
    'column_rabo-debet-credit'      => 'Конкретні рабобанк дебет/показник кредит',
    'column_ing-debet-credit'       => 'ІНГ конкретних дебет/показник кредит',
    'column_sepa-ct-id'             => 'Кредиту sepa передачі наскрізного ідентифікатора',
    'column_sepa-ct-op'             => 'Кредитний Переказ протилежні рахунку СЕЛА',
    'column_sepa-db'                => 'Прямий Дебет СЕЛА',
    'column_tags-comma'             => 'Теги (через кому)',
    'column_tags-space'             => 'Теги (через пробіл)',
    'column_account-number'         => 'Активний рахунок (номер рахунку)',
    'column_opposing-number'        => 'Протилежні рахунку (номер рахунку)',
];